{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Задание 1\n",
    "\n",
    "Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n",
    "\n",
    "    среднюю букву, если число букв в слове нечетное;\n",
    "    две средних буквы, если число букв четное.\n",
    "\n",
    "Примеры работы программы:\n",
    "\n",
    "    word = 'test'\n",
    "\n",
    "Результат:\n",
    "es\n",
    "\n",
    "    word = 'testing'\n",
    "\n",
    "Результат:\n",
    "t\"\"\"\"\"\n",
    "\n",
    "x=input('Введите слово')\n",
    "y=len(x)\n",
    "z=y/2\n",
    "if y%2==0:\n",
    "    print(x[int(z)-1:3])\n",
    "else:\n",
    "    print(x[int(z)])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число1\n",
      "Введите число2\n",
      "Введите число3\n",
      "Введите число0\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "\"\"\"\"Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз)\n",
    "и после первого нуля выводит сумму всех ранее введенных чисел.\n",
    "\n",
    "Примеры работы программы:\n",
    "\n",
    "Введите число:  \n",
    "1\n",
    "\n",
    "Введите число:  \n",
    "4\n",
    "\n",
    "Введите число:  \n",
    "6\n",
    "\n",
    "Введите число:  \n",
    "0\n",
    "\n",
    "Результат:\n",
    "11\n",
    "\n",
    "Введите число:  \n",
    "0\n",
    "\n",
    "Результат:\n",
    "0\"\"\"\n",
    "\n",
    "\n",
    "sum = 0\n",
    "while True:\n",
    "    n = int(input('Введите число'))\n",
    "    if n == 0: break\n",
    "    sum += n\n",
    "print(sum)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[('Alex', 'Emma'), ('Arthur', 'Kate'), ('John', 'Kira'), ('Peter', 'Liza'), ('Richard', 'Trisha')]\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\"\"\"\"Задание 3\n",
    "\n",
    "Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.\n",
    "Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:\n",
    "\n",
    "Примеры работы программы:\n",
    "\n",
    "boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']\n",
    "girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n",
    "\n",
    "Результат:\n",
    "\n",
    "Идеальные пары:  \n",
    "Alex и Emma  \n",
    "Arthur и Kate  \n",
    "John и Kira  \n",
    "Peter и Liza  \n",
    "Richard и Trisha\n",
    "\n",
    "boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael']\n",
    "girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n",
    "\n",
    "Результат:\n",
    "Внимание, кто-то может остаться без пары!\"\"\"\n",
    "\n",
    "boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']\n",
    "girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n",
    "x=sorted(boys)\n",
    "y=sorted(girls)\n",
    "c=zip(x,y)\n",
    "if len(x)!=len(y):\n",
    "    print ('Внимание, кто-то может остаться без пары!')\n",
    "else: print(list(c))\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Средняя температура в странах:\n",
      "В Тайланде- 23.0 C\n",
      "В Германии- 13.0 C\n",
      "В России- 3.0 C\n",
      "В Польше 11.0 C\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\"\"\"\"Задание 4\n",
    "\n",
    "У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах \n",
    "за произвольный период по странам (структура данных в примере).\n",
    "Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "countries_temperature = [\n",
    "    ['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n",
    "    ['Germany', [57.2, 55.4, 59, 59, 53.6]],\n",
    "    ['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n",
    "    ['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n",
    "]\n",
    "\n",
    "Результат:\n",
    "\n",
    "Средняя температура в странах:\n",
    "Thailand  -  23.9 С\n",
    "Germany  -  13.8 С\n",
    "Russia  -  3.7 С\n",
    "Poland  -  12.0 С\"\"\"\n",
    "\n",
    "countries_temperature = [\n",
    " ['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n",
    " ['Germany', [57.2, 55.4, 59, 59, 53.6, 55.4, 57.2]],\n",
    " ['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n",
    " ['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4, 51.8]],\n",
    "]\n",
    "T=countries_temperature[0]\n",
    "G=countries_temperature[1]\n",
    "R=countries_temperature[2]\n",
    "P=countries_temperature[3]\n",
    "t=T[1]\n",
    "g=G[1]\n",
    "r=R[1]\n",
    "p=P[1]\n",
    "print(\"Средняя температура в странах:\")\n",
    "print(\"В Тайланде-\", ( (5/9*(t[0]-32))+ (5/9*(t[1]-32))+ (5/9*(t[2]-32))+ (5/9*(t[3]-32))+ (5/9*(t[4]-32))+ (5/9*(t[5]-32))+ (5/9*(t[6]-32))) //7, \"C\")\n",
    "print(\"В Германии-\", ( (5/9*(g[0]-32))+ (5/9*(g[1]-32))+ (5/9*(g[2]-32))+ (5/9*(g[3]-32))+ (5/9*(g[4]-32))+ (5/9*(g[5]-32))+ (5/9*(g[6]-32))) //7, \"C\")\n",
    "print(\"В России-\", ( (5/9*(r[0]-32))+ (5/9*(r[1]-32))+ (5/9*(r[2]-32))+ (5/9*(r[3]-32))+ (5/9*(r[4]-32))+ (5/9*(r[5]-32))+ (5/9*(r[6]-32))) //7, \"C\")\n",
    "print(\"В Польше\", ( (5/9*(p[0]-32))+ (5/9*(p[1]-32))+ (5/9*(p[2]-32))+ (5/9*(p[3]-32))+ (5/9*(p[4]-32))+ (5/9*(p[5]-32))+ (5/9*(p[6]-32))) //7, \"C\")\n",
    "\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
